index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>CNFgen</title>
<!-- 2015-05-26 Tue 15:48 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Massimo Lauria" />
<link rel="stylesheet" type="text/css" media="screen" href="stylesheets/stylesheet.css">
<meta charset='utf-8'>
<meta http-equiv="X-UA-Compatible" content="chrome=1">
<meta name="description" content="CNFgen : Cool benchmarks for your SAT solver!">
</head>
<body>
<div id="content">
<h1 class="title">CNFgen</h1>
<!-- HEADER -->
    <div id="header_wrap" class="outer">
        <header class="inner">
          <a id="forkme_banner" href="https://github.com/MassimoLauria/cnfgen">View on GitHub</a>

          <h1 id="project_title">CNFgen</h1>
          <h2 id="project_tagline">Cool benchmarks for your SAT solver!</h2>

            <section id="downloads">
              <a class="zip_download_link" href="https://github.com/MassimoLauria/cnfgen/zipball/master">Download this project as a .zip file</a>
              <a class="tar_download_link" href="https://github.com/MassimoLauria/cnfgen/tarball/master">Download this project as a tar.gz file</a>
            </section>
        </header>
    </div>
<div id="main_content_wrap" class="outer">
  <section id="main_content" class="inner">

<p>
CNFgen is a tool that  produces the combinatorial benchmarks in DIMACS
format for  SAT solvers,  coming from  edge-cutting research  in Proof
Complexity  (e.g.   pigeonhole  principle,  ordering   principle,  …).
These  formulas  are particularly  suitable  to  test the  limits  and
extremal behavior of solving heuristics.
</p>

<div id="outline-container-sec-1" class="outline-3">
<h3 id="sec-1">Features</h3>
<div class="outline-text-3" id="text-1">
<ul class="org-ul">
<li><code>cnfgen</code> generator for <a href="background.html">CNF formula</a> benchmarks,
</li>
<li>the python library <code>cnfformula</code> for more flexible CNF generation and manipulation,
</li>
<li>behind-the-scene integration with many SAT solvers,
</li>
<li>output in DIMACS and LaTeX formats,
</li>
<li>formula <a href="transformation.html">post-processing</a>.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-3">
<h3 id="sec-2">Installation</h3>
<div class="outline-text-3" id="text-2">
<p>
You can install CNFgen from  <a href="http://pypi.python.org">Python Package Index</a>, together with all
its dependencies, typing either
</p>

<pre class="example">
easy_install [--user] cnfgen
</pre>

<p>
or
</p>

<pre class="example">
pip install  [--user] cnfgen
</pre>

<p>
Otherwise it  is possible to install from source using
</p>

<pre class="example">
python setup.py install [--user]
</pre>

<p>
In all  cases the <code>--user</code> option  allows to install the  package in
the user home directory. In this case please check that the location
where the command line utilities are installed is in your <code>PATH</code>.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-3">
<h3 id="sec-3">Quickstart</h3>
<div class="outline-text-3" id="text-3">
<p>
To produce a DIMACS file type
</p>

<pre class="example">
cnfgen [-o &lt;output_file&gt;] &lt;formula_type&gt; &lt;formula_parameters&gt;
</pre>

<p>
where each  choice of  <code>&lt;formula_type&gt;</code> has  its own  parameters and
options.  For  example here's  how  to  get a  pigeonhole  principle
formula from 10 pigeons to 7 holes printed to standard output:
</p>

<pre class="example">
cnfgen php 10 7 
</pre>

<p>
We implement  several families of  formula in <code>cnfgen</code> tool.  Now we
briefly  describe  some  of  them, with  the  principal  parameters.
For  a  full  list  of implemented  formula  families  type  <code>cnfgen
  --help</code>. To get specific information on one each family use
</p>

<pre class="example">
cnfgen &lt;formula_type&gt; --help
</pre>
</div>


<div id="outline-container-sec-3-1" class="outline-4">
<h4 id="sec-3-1">Pigeonhole Principle</h4>
<div class="outline-text-4" id="text-3-1">
<p>
The formula  claims that  it is  possible to assign \(m\) pigeons  to \(n\)
holes so that
</p>

<ul class="org-ul">
<li>each pigeon gets at least a hole;
</li>
<li>no to pigeons get the same hole.
</li>
</ul>

<pre class="example">
cnfgen php &lt;m&gt; &lt;n&gt;
</pre>

<p>
This formula is clearly unsatisfiable in \(m>n\). In literature there
are other variants of this formula:
</p>

<ul class="org-ul">
<li>in <b>functional</b> PHP every pigeon is assigned to exactly one hole;
</li>
<li>in <b>onto</b> PHP every hole must contain at least a pigeon;
</li>
<li><b>matching</b> PHP has both <b>functional</b> and <b>onto</b> clauses.
</li>
</ul>

<p>
You can  add functional  and onto clauses  using the  command line
options.
</p>

<pre class="example">
cnfgen php [--functional] [--onto] &lt;P&gt; &lt;N&gt;
</pre>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-4">
<h4 id="sec-3-2">Tseitin  formulas</h4>
<div class="outline-text-4" id="text-3-2">
<p>
Tseitin  formula  represent a  particular  linear  system based  on
graphs. Start  from a  graph G  such that  each vertex  is labelled
either 0 or 1. The formula claim that  you can put labels 0 or 1 on
the edges of G  so that the label of each vertex v  is equal to the
sum of the labels on the edges incident to v (module 2).
</p>

<pre class="example">
cnfgen tseitin –charge &lt;type&gt; -i &lt;input_graph&gt;
</pre>

<p>
The initial  charge of  the vertices is  either <code>first</code>  (only the
first  vertex is  labeled 1) or  one  of <code>random</code>,  <code>randomodd</code>,
<code>randomeven</code>.
</p>

<p>
While in general the graph can be provided in input, there are some
immediately usable.
</p>

<pre class="example">
cnfgen tseitin --charge random --grid 10 10
</pre>

<p>
Produces  a <code>tseitin</code>  formula over  a 10  by 10  grid graph,  with
labeling of the vertices uniformily random.
</p>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-4">
<h4 id="sec-3-3">Ordering principle</h4>
<div class="outline-text-4" id="text-3-3">
<p>
The  formula claims  that  there is  partial order  over  a set  of
N elements, such  that every element has at  least one predecessor.
For example the  DIMACS formula for the ordering  principle over 30
elements is generated by
</p>

<pre class="example">
cnfgen op 30
</pre>

<p>
The graph ordering  principle is a variant  of ordering principle:
given a graph G  of n vertices, the formula claim  that there is a
partial (or total) order on V(G),  such that every vertex there is
another one which is
</p>

<ul class="org-ul">
<li>a predecessor in the order;
</li>
<li>a neighbor in the graph.
</li>
</ul>

<pre class="example">
cnfgen gop -i &lt;input_graph&gt;
</pre>

<p>
The  vanilla ordering  principle equivalent  to the  graph ordering
principle if  the underlying graph is  the complete one, as  in the
example
</p>

<pre class="example">
cnfgen gop --complete 30
</pre>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-4">
<h4 id="sec-3-4">Pebbling formula</h4>
<div class="outline-text-4" id="text-3-4">
<p>
A directed acyclic graph G has some vertices with no incoming arcs
(<b>sources</b>) and  vertices with no  outgoing arcs (<b>sinks</b>).  For a
given directed acyclic graph G,  the pebbling formula for G claims
that:
</p>

<ul class="org-ul">
<li>there is a pebble on every source;
</li>
<li>if all predecessors  of vertex v are pebbled, then  v is pebbled
too;
</li>
<li>the sinks are not pebbled.
</li>
</ul>

<p>
For  example we  can generate  the  pebbling formula  for a  rooted
binary tree of height 10 with
</p>

<pre class="example">
cnfgen peb --tree 10
</pre>

<p>
and we can do the same for a graph in input using 
</p>

<pre class="example">
cnfgen peb -i &lt;input_dag&gt;
</pre>
</div>
</div>

<div id="outline-container-sec-3-5" class="outline-4">
<h4 id="sec-3-5">K-clique formula</h4>
<div class="outline-text-4" id="text-3-5">
<p>
If given a graph G, the formula  claims that there is no clique of
size at least k in the graph G. 
</p>

<pre class="example">
cnfgen kclique &lt;k&gt; -i &lt;input_graph&gt; 
</pre>

<p>
There is the additional option  <code>--plantclique</code> that plant a random
clique  in the  graph. In  this  way it  is possible  to study  the
behavior of SAT solver on  the <i>hidden clique problem</i>. For example
the formula generated by
</p>

<pre class="example">
cnfgen kclique 10 --gnp 200 0.5 --plantclique 15
</pre>

<p>
claims that  there is a clique  of size 10 in  a random Erdös-Renyi
graph with 200 vertices where a clique of size 15 has been planted.
</p>
</div>
</div>

<div id="outline-container-sec-3-6" class="outline-4">
<h4 id="sec-3-6">Ramsey number formula</h4>
<div class="outline-text-4" id="text-3-6">
<p>
The simplest  version of the  famous <i>Ramsey theorem</i> says  that for
every s and  k there is a  number r(s,k) such that  every graph of
r(s,k)  vertices has  either an  independent set  of size  s or  a
clique of size k. Command line
</p>

<pre class="example">
cnfgen ram &lt;s&gt; &lt;k&gt; &lt;N&gt;
</pre>

<p>
produces  a formula  that claims  that r(s,k)&gt;N.
</p>
</div>
</div>
</div>


<div id="outline-container-sec-4" class="outline-3">
<h3 id="sec-4">Acknowledgments</h3>
<div class="outline-text-3" id="text-4">
<p>
The CNFgen project is  by Massimo Lauria (<a href="mailto:lauria.massimo@gmail.com">lauria.massimo@gmail.com</a>),
with helps and contributions by Marc Vinyals, Mladen Mikša and <a href="http://www.csc.kth.se/~jakobn/">Jakob
Nordström</a>  from  KTH Royal  Institute  of  Technology in  Stockholm,
Sweden. Massimo Lauria is maintaining  and developing the tool while
funded by the  European Research Council under  the European Union's
Seventh  Framework Programme  (FP7/2007&#x2013;2013)  ERC grant  agreement
no. 279611.
</p>


</section></div>
<!-- FOOTER  -->
<div id="footer_wrap" class="outer">
  <footer class="inner">
    <p class="copyright">CNFgen maintained by <a href="https://github.com/MassimoLauria">MassimoLauria</a></p>
    <p>Published with <a href="https://pages.github.com">GitHub Pages</a></p>
  </footer>
</div>
</div>
</div>
</div>
</body>
</html>
